export const con = {
    welMes: "欢迎",   //欢迎语
    set: {  //高级设置
        permissionTag: "AdvancedOP",   //设置菜单高级项(目前包括 重置新手礼包)使用所需权限
        ui: {
            title: "§l§e工具菜单",   //菜单名
            body: "欢迎使用工具菜单，本工具由FasterYard51037制作",   //菜单欢迎语
            text1: "传送到玩家",   //功能提示
            text2: "§e重置新手礼包",   //功能提示
            text3: "设置重生点"  //功能提示
        },
        playerSpawnGife: {  //玩家生成礼物(新手礼物)
            item: [  //可获得的礼物(,英文逗号勿忘)
                "acacia_log",  //仅包含物品id
                "red_flower 5",  //包含物品id和数量
                "stick 1 0 ",   //包含物品id数量和属性值
            ],
            tag: "hasGife",   //标签，使用标签的方法判断是否可以获得新手礼物
            mes: "§e欢迎进入游戏，已为您发送新手礼包",   //新手礼包发送提示
            mes1: "§e新手礼包已重置",   //已重置新手礼包提示
            mes2: "§c您没有权限，无法重置新手礼包"  //新手礼包重置失败提示
        }
    },
    com: {  //命令相关
        head: "+", //命令标识符，最多仅支持一个字符
        spawn:{  //spawnpoint命令
            mes: "§e重生点设置成功"  //执行成功后的提示文本
        }
    },
    ui: {  //常规用户界面相关
        set_title: "重生点设置",  //设置出生点ui的标题
        set: {  //设置重生点ui相关
            text1: "X坐标",
            text2: "Y坐标",
            text3: "Z坐标",
            textDef1: "输入一个x坐标",
            textDef2: "输入一个y坐标",
            textDef3: "输入一个z坐标",
            mes: "§e您的重生点已成功设置为 §c[",   //重生点设置成功提示
            mes1: "重生点设置ui已打开,如果您想直接设置当前的重生点位置,请使用 %%sspawnpoint 命令"   //重新点设置ui打开提示
        },
        tpUi_title: "传送菜单",   //传送菜单ui的标题
        tpUi: {   //传送菜单ui相关
            downDef: "选择传送目标",
            mes: "§c已发送传送申请"   //传送申请发送提示
        },
        tpUiSwich_title: "传送申请询问",  //传送申请确定ui的标题
        tpUiSwitch: {
            error: "错误:如果您看到了本行文字，请立刻关闭窗口",   //错误消息
            a: "同意",  //ui同意按钮显示字
            b: "否决",  //ui否决按钮显示字
            body: "玩家 §e%%s §r请求传送到您的位置，是否同意?",   //ui主题文本显示字
            mesBT: "§c您拒绝了ta的请求",   //拒绝请求通过提示信息
            mesBS: "§c对方拒绝了您的请求",   //被拒绝请求通过提示信息
            mesAT: "§e您通过了对方的请求",   //请求通过提示信息
            mesAS: "§e对方通过了您的请求，传送尝试中",   //请求被通过提示信息
            mesA: "§e传送成功"  //传送成功提示
        }
    },
    item: {   //物品相关
        set:{  //设置菜单触发
            typeId: "minecraft:stick",  //触发物品类型
            nameTag: "工具"   //物品使用的名称
        }
    }
};